# Chapter 8. Data Wrangling: Join, Combine and Reshape

## 8.1 Hierarchical indexing

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.Series(np.random.randn(9), index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], 
                                            [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data

a  1   -0.360867
   2    0.145264
   3   -0.098047
b  1   -0.993148
   3   -0.440683
c  1    3.032393
   2    1.696604
d  2    1.474263
   3    1.489414
dtype: float64

In [5]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [6]:
data['b']

1   -0.993148
3   -0.440683
dtype: float64

In [7]:
data['b':'c']

b  1   -0.993148
   3   -0.440683
c  1    3.032393
   2    1.696604
dtype: float64

In [8]:
data.loc[['b', 'c']]

b  1   -0.993148
   3   -0.440683
c  1    3.032393
   2    1.696604
dtype: float64

In [9]:
data.loc[:, 2]

a    0.145264
c    1.696604
d    1.474263
dtype: float64

In [10]:
data.unstack()

          1         2         3
a -0.360867  0.145264 -0.098047
b -0.993148       NaN -0.440683
c  3.032393  1.696604       NaN
d       NaN  1.474263  1.489414

In [11]:
data.unstack(level=0)

          a         b         c         d
1 -0.360867 -0.993148  3.032393       NaN
2  0.145264       NaN  1.696604  1.474263
3 -0.098047 -0.440683       NaN  1.489414

In [12]:
data.unstack().stack()

a  1   -0.360867
   2    0.145264
   3   -0.098047
b  1   -0.993148
   3   -0.440683
c  1    3.032393
   2    1.696604
d  2    1.474263
   3    1.489414
dtype: float64

In [37]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], 
                     columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [38]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [39]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [40]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [41]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [42]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [43]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [44]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [45]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [46]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [47]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})

In [48]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [53]:
frame2 = frame.set_index(['c', 'd'], drop=True)

In [55]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [54]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 8.2 Combining and Merging Datasets

* pandas.merge
* pandas.concat
* pandas.combine_first

In [56]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [57]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [58]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [59]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [60]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [61]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [62]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [63]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [66]:
pd.merge(df1, df2, how='outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

* **_inner_** - Use only the key combinations observed in both tables
* **_left_** - Use all key combinations found in the left table
* **_right_** - Use all key combinations found in the right table
* **_outer_** - Use all key combinations observed in both tables together